In [2]:
# element accessing row /column
# LOC and ILOC--->location and index location based

In [13]:
import pandas as pd
df=pd.DataFrame({"name":['pinky','ponky','pop','push'],"rollnumber":[431,432,433,434],"branch":["ece","cse","eee","civil"]})
df

    name  rollnumber branch
0  pinky         431    ece
1  ponky         432    cse
2    pop         433    eee
3   push         434  civil

In [40]:
df=pd.DataFrame({"name":['pinky','ponky','pop','push'],"rollnumber":[431,432,433,434],"branch":["ece","cse","eee","civil"]},index=[1,2,3,4])
df

    name  rollnumber branch
1  pinky         431    ece
2  ponky         432    cse
3    pop         433    eee
4   push         434  civil

In [41]:
df.loc[4]

name           push
rollnumber      434
branch        civil
Name: 4, dtype: object

In [42]:
df.iloc[0:3]

    name  rollnumber branch
1  pinky         431    ece
2  ponky         432    cse
3    pop         433    eee

In [43]:
df.loc[1]

name          pinky
rollnumber      431
branch          ece
Name: 1, dtype: object

In [44]:
df.loc[2]['rollnumber']

432

In [45]:
df.loc[3]['branch']

'eee'

In [46]:
df.describe()

       rollnumber
count    4.000000
mean   432.500000
std      1.290994
min    431.000000
25%    431.750000
50%    432.500000
75%    433.250000
max    434.000000

In [47]:
df.count()

name          4
rollnumber    4
branch        4
dtype: int64

In [48]:
df.dtypes

name          object
rollnumber     int64
branch        object
dtype: object

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 1 to 4
Data columns (total 3 columns):
name          4 non-null object
rollnumber    4 non-null int64
branch        4 non-null object
dtypes: int64(1), object(2)
memory usage: 288.0+ bytes

In [50]:
df.iloc[0:3]["name"]

1    pinky
2    ponky
3      pop
Name: name, dtype: object

In [51]:
df.count(axis=0)

name          4
rollnumber    4
branch        4
dtype: int64

In [52]:
df.count(axis="rows")

name          4
rollnumber    4
branch        4
dtype: int64

In [53]:
df.count(axis="columns")

1    3
2    3
3    3
4    3
dtype: int64

In [54]:
df.count(axis=1)

1    3
2    3
3    3
4    3
dtype: int64

In [55]:
df.set_index(["rollnumber"])

             name branch
rollnumber
431         pinky    ece
432         ponky    cse
433           pop    eee
434          push  civil

In [56]:
df.set_index(["rollnumber","branch"])

                    name
rollnumber branch
431        ece     pinky
432        cse     ponky
433        eee       pop
434        civil    push

In [57]:

frame=pd.Series([2,3,4,5,6],[1,6,7,8,9])
frame

1    2
6    3
7    4
8    5
9    6
dtype: int64

In [58]:
frame.isnull()

1    False
6    False
7    False
8    False
9    False
dtype: bool

In [59]:
frame.notnull()

1    True
6    True
7    True
8    True
9    True
dtype: bool

In [60]:
frame.count()

5

In [61]:
frame.describe()

count    5.000000
mean     4.000000
std      1.581139
min      2.000000
25%      3.000000
50%      4.000000
75%      5.000000
max      6.000000
dtype: float64

In [62]:
# dataframe by using numpy

In [69]:
import numpy as np
a=np.arange(9)
a

array([0, 1, 2, 3, 4, 5, 6, 7, 8])

In [70]:
a.reshape(3,3)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [72]:
data=pd.DataFrame(np.arange(12))
data

     0
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10
11  11

In [73]:
data=pd.DataFrame(np.arange(12).reshape(3,4))
data

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [74]:
data=pd.DataFrame(np.arange(12).reshape(3,4),columns=['a','b','c','d'])
data

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [75]:
data=pd.DataFrame(np.arange(12).reshape(3,4),columns=['a','b','c','d'],index=['x','y','z'])
data

   a  b   c   d
x  0  1   2   3
y  4  5   6   7
z  8  9  10  11

In [78]:
data1=pd.DataFrame(np.arange(20).reshape(5,4),columns=['w','x','y','z'],index=['a','b','c','d','e'])
data1

    w   x   y   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15
e  16  17  18  19

In [98]:
data.loc['b','x'],np.nan

(nan, nan)

In [82]:
data.isnull().sum

<bound method DataFrame.sum of        w      x      y      z
a  False  False  False  False
b  False  False  False  False
c  False  False  False  False
d  False  False  False  False
e  False  False  False  False>

In [87]:
df+data

  branch name  rollnumber   w   x   y   z
1    NaN  NaN         NaN NaN NaN NaN NaN
2    NaN  NaN         NaN NaN NaN NaN NaN
3    NaN  NaN         NaN NaN NaN NaN NaN
4    NaN  NaN         NaN NaN NaN NaN NaN
a    NaN  NaN         NaN NaN NaN NaN NaN
b    NaN  NaN         NaN NaN NaN NaN NaN
c    NaN  NaN         NaN NaN NaN NaN NaN
d    NaN  NaN         NaN NaN NaN NaN NaN
e    NaN  NaN         NaN NaN NaN NaN NaN

In [95]:
dd=df.add(data)
dd

  branch name  rollnumber   w   x   y   z
1    NaN  NaN         NaN NaN NaN NaN NaN
2    NaN  NaN         NaN NaN NaN NaN NaN
3    NaN  NaN         NaN NaN NaN NaN NaN
4    NaN  NaN         NaN NaN NaN NaN NaN
a    NaN  NaN         NaN NaN NaN NaN NaN
b    NaN  NaN         NaN NaN NaN NaN NaN
c    NaN  NaN         NaN NaN NaN NaN NaN
d    NaN  NaN         NaN NaN NaN NaN NaN
e    NaN  NaN         NaN NaN NaN NaN NaN

In [97]:
dd.add(data,fill_value=1)

  branch name  rollnumber     w     x     y     z
1    NaN  NaN         NaN   NaN   NaN   NaN   NaN
2    NaN  NaN         NaN   NaN   NaN   NaN   NaN
3    NaN  NaN         NaN   NaN   NaN   NaN   NaN
4    NaN  NaN         NaN   NaN   NaN   NaN   NaN
a    NaN  NaN         NaN   1.0   2.0   3.0   4.0
b    NaN  NaN         NaN   5.0   NaN   7.0   8.0
c    NaN  NaN         NaN   9.0  10.0  11.0  12.0
d    NaN  NaN         NaN  13.0  14.0  15.0  16.0
e    NaN  NaN         NaN  17.0  18.0  19.0  20.0

In [99]:
dd.add(data,fill_value=0)

  branch name  rollnumber     w     x     y     z
1    NaN  NaN         NaN   NaN   NaN   NaN   NaN
2    NaN  NaN         NaN   NaN   NaN   NaN   NaN
3    NaN  NaN         NaN   NaN   NaN   NaN   NaN
4    NaN  NaN         NaN   NaN   NaN   NaN   NaN
a    NaN  NaN         NaN   0.0   1.0   2.0   3.0
b    NaN  NaN         NaN   4.0   NaN   6.0   7.0
c    NaN  NaN         NaN   8.0   9.0  10.0  11.0
d    NaN  NaN         NaN  12.0  13.0  14.0  15.0
e    NaN  NaN         NaN  16.0  17.0  18.0  19.0

In [100]:
np.random.rand(1,7)

array([[0.83206036, 0.98926874, 0.46726761, 0.69229767, 0.54573942,
        0.64206049, 0.19261503]])

In [101]:
np.random.randn(1,7)

array([[-0.86370755,  0.64886691, -1.08594206,  0.42365226, -0.84597367,
         0.15127014,  0.26446166]])

In [102]:
# creating a dataframe with random values

In [105]:
r=pd.DataFrame(np.random.randn(3,10))
r

,0,1,2,3,4,5,6,7,8,9
0,0.584937,-0.742559,1.072029,0.035261,1.714624,1.046053,-1.150027,0.430373,1.905034,-0.168068
1,1.752219,-1.788513,-0.631290,0.861074,-0.351031,-0.257475,0.133749,1.363443,-2.007736,-1.666696
2,-1.372073,1.621382,0.205079,-1.657647,-1.325080,0.797684,0.247319,0.138919,-0.115784,0.374199

In [107]:
r=pd.DataFrame(np.random.randn(3,4))
r

          0         1         2         3
0  0.970720 -1.165051  0.999095  1.122133
1  0.941853 -0.695333  0.161013  0.340671
2 -0.810966  0.326263  0.243005  0.358818

In [109]:
r=pd.DataFrame(np.random.randn(3,4),index=['a1','a2','a3'])  # r.ccolumns=["1","2","3","4"]
r

           0         1         2         3
a1  0.107095 -0.360664 -1.326739 -1.573297
a2  0.649344  0.116188 -0.111745  0.634778
a3  0.197814 -1.739137 -0.488841 -0.210577

In [118]:
r1=pd.DataFrame(np.random.randn(3,4),index=['a1','a2','a3'],columns=['b1','b2','b3','b4'])
r1

          b1        b2        b3        b4
a1 -0.676076  0.639801 -0.990002  0.260238
a2  1.955213 -0.316902 -0.982843 -0.064807
a3 -1.564071  0.649865 -0.446344  1.195135

In [114]:
# index replace Re indexing

In [119]:
s=r1.reindex([1,2,3,4])
s

   b1  b2  b3  b4
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN
4 NaN NaN NaN NaN

In [120]:
s.isnull().sum()

b1    4
b2    4
b3    4
b4    4
dtype: int64

In [ ]:
# filling a drop values

In [121]:
s.dropna()

Empty DataFrame
Columns: [b1, b2, b3, b4]
Index: []

In [ ]:
# filling a null values

In [122]:
s.fillna(123)

      b1     b2     b3     b4
1  123.0  123.0  123.0  123.0
2  123.0  123.0  123.0  123.0
3  123.0  123.0  123.0  123.0
4  123.0  123.0  123.0  123.0

In [134]:
s.fillna(method='bfill',axis=0).fillna(0)   # backward filldf3 = df2.fillna(method = 'bfill',axis = 0)

    b1   b2   b3   b4
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0
4  0.0  0.0  0.0  0.0

In [135]:
s.fillna(method='ffill',axis=1).fillna(1)  # forward fill

    b1   b2   b3   b4
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0

In [128]:
s.isna()

     b1    b2    b3    b4
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True
4  True  True  True  True

In [129]:
s.isnull()

     b1    b2    b3    b4
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True
4  True  True  True  True

In [141]:
pd.isna(s["b2"])

1    True
2    True
3    True
4    True
Name: b2, dtype: bool

In [142]:
# data replacing

In [148]:
df3=pd.DataFrame({11:[4,5,6],12:[66,77,88],13:[11,22,33]})
df3

   11  12  13
0   4  66  11
1   5  77  22
2   6  88  33

In [151]:
df3.replace(4,999)  # single replace

    11  12  13
0  999  66  11
1    5  77  22
2    6  88  33

In [165]:
df32=df3.replace([66,77,88],[45,67,89])
df32

   11  12  13
0   4  45  11
1   5  67  22
2   6  89  33

In [166]:
# index sorting and ranking

In [167]:
r2=df3.reindex(['a','b','c'])
r2

   11  12  13
a NaN NaN NaN
b NaN NaN NaN
c NaN NaN NaN

In [168]:
r2.sort_index()

   11  12  13
a NaN NaN NaN
b NaN NaN NaN
c NaN NaN NaN

In [169]:
r2.columns=['s1','s2','s3']
r2

   s1  s2  s3
a NaN NaN NaN
b NaN NaN NaN
c NaN NaN NaN

In [170]:
r2.sort_index(axis=1)

   s1  s2  s3
a NaN NaN NaN
b NaN NaN NaN
c NaN NaN NaN

In [171]:
# groupby

In [175]:
animal_df=pd.DataFrame({"name":['tiger','lion','cat','tiger','cat'],"place":['forest','home','zoo','zoo','home'],"features":['shouting','banking','security','security','banking']})
animal_df

    name   place  features
0  tiger  forest  shouting
1   lion    home   banking
2    cat     zoo  security
3  tiger     zoo  security
4    cat    home   banking

In [179]:
animal_df.groupby(['name']).sum()

           place          features
name
cat      zoohome   securitybanking
lion        home           banking
tiger  forestzoo  shoutingsecurity

In [180]:
animal_df.groupby(['name']).sum().count()

place       3
features    3
dtype: int64

In [181]:
animal_df.groupby(['name','features']).sum()

                 place
name  features
cat   banking     home
      security     zoo
lion  banking     home
tiger security     zoo
      shouting  forest

In [197]:
animal_df1=pd.DataFrame({"name":['tiger','lion','cat','tiger','cat'],"place":['forest','home','zoo','zoo','home'],"features":['shouting','banking','security','security','banking'],"nooflegs":[4,2,4,3,'nan']})
animal_df1

    name   place  features nooflegs
0  tiger  forest  shouting        4
1   lion    home   banking        2
2    cat     zoo  security        4
3  tiger     zoo  security        3
4    cat    home   banking      nan

In [198]:
animal_df1['rank']=animal_df1['nooflegs'].rank()
animal_df1

    name   place  features nooflegs  rank
0  tiger  forest  shouting        4   NaN
1   lion    home   banking        2   NaN
2    cat     zoo  security        4   NaN
3  tiger     zoo  security        3   NaN
4    cat    home   banking      nan   NaN

In [206]:
animal_df1['max-rank']=animal_df1['nooflegs'].rank(method='max')
animal_df1

    name   place  features nooflegs  rank  max-rank  max-rank1
0  tiger  forest  shouting        4   NaN       NaN        NaN
1   lion    home   banking        2   NaN       NaN        NaN
2    cat     zoo  security        4   NaN       NaN        NaN
3  tiger     zoo  security        3   NaN       NaN        NaN
4    cat    home   banking      nan   NaN       NaN        NaN

In [209]:
animal_df1['max-rank1']=animal_df1['nooflegs'].rank(pct=True)                                                     (na_option="bottom")

TypeError: 'Series' object is not callable

In [212]:
# categories

In [216]:
d_f=pd.DataFrame({'x':[1,2,3,4,5],'y':[6,7,8,9,10]})
d_f

   x   y
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [218]:
d_f['cc']=d_f['y'].astype('category')
d_f

   x   y  cc
0  1   6   6
1  2   7   7
2  3   8   8
3  4   9   9
4  5  10  10

In [219]:
d_f['cc']

0     6
1     7
2     8
3     9
4    10
Name: cc, dtype: category
Categories (5, int64): [6, 7, 8, 9, 10]

In [221]:
d_f['cc'].cat.categories=['good','bad','poor','excellent','vergood']
d_f

   x   y         cc
0  1   6       good
1  2   7        bad
2  3   8       poor
3  4   9  excellent
4  5  10    vergood

In [223]:
d_f['cc']=d_f['cc'].set_categories=['good','bad','poor','excellent','vergood']
d_f

   x   y         cc
0  1   6       good
1  2   7        bad
2  3   8       poor
3  4   9  excellent
4  5  10    vergood

In [224]:
d_f.sort_values('cc')

   x   y         cc
1  2   7        bad
3  4   9  excellent
0  1   6       good
2  3   8       poor
4  5  10    vergood

In [225]:
d_f.groupby('cc').sum()

           x   y
cc
bad        2   7
excellent  4   9
good       1   6
poor       3   8
vergood    5  10

In [227]:
d_f.groupby('cc').size()

cc
bad          1
excellent    1
good         1
poor         1
vergood      1
dtype: int64

In [234]:
df=pd.read_table("sample.txt")
df

C:\Users\public\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

   a b c
0   1 2 3
1  4 5 6
2   7 8 9

In [241]:
df=pd.read_table('ex1.csv',sep=',')
df

C:\Users\public\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo